# Задайте список из вещественных чисел. Напишите программу, которая найдёт
#  разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19            

# ш(str))


# n= float(input())
# n=(n%1)*100
# print(n>50)


str= input()
if str[::]==str[::-1]:
    print("ДА")
else:
    print("НЕТ")